src/cf/Catalogs/кзоСобытияЭлементовФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>кзоСобытияЭлементовФорм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кзоМоментыВыполненияПодключаемыхОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/кзоСобытияЭлементовФорм/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	ПроверитьДубликаты(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Процедура ПроверитьДубликаты(Отказ)

	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияЭлементовФорм.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.кзоСобытияЭлементовФорм КАК СобытияЭлементовФорм
		|ГДЕ
		|	СобытияЭлементовФорм.Ссылка <> &Ссылка
		|	И СобытияЭлементовФорм.ОбъектМетаданных = &ОбъектМетаданных
		|	И СобытияЭлементовФорм.ИмяФормы = &ИмяФормы
		|	И СобытияЭлементовФорм.ИмяЭлемента = &ИмяЭлемента
		|	И СобытияЭлементовФорм.ИмяСобытия = &ИмяСобытия
		|	И НЕ СобытияЭлементовФорм.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	Запрос.УстановитьПараметр("ИмяФормы", ИмяФормы);
	Запрос.УстановитьПараметр("ИмяЭлемента", ИмяЭлемента);
	Запрос.УстановитьПараметр("ИмяСобытия", ИмяСобытия);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Текст = СтрШаблон(
		"Найдено событие элемента формы ""%1"" с совпадающими реквизитами:
		|%2, %3, %4, %5",
		Выборка.Ссылка,
		ОбъектМетаданных,
		ИмяФормы,
		ИмяЭлемента,
		ИмяСобытия
	);
	
	ОбщегоНазначения.СообщитьПользователю(Текст, Ссылка, , , Отказ);
	
КонецПроцедуры

#КонецОбласти
